app/controllers/distros_controller.rb

SELECT "distros".* FROM "distros" WHERE "distros"."name" = 'ubuntu' ORDER BY "distros"."id" ASC LIMIT 1
SELECT "distros".* FROM "distros" WHERE "distros"."id" = ? LIMIT 1  [["id", "3"]]
---
  def set_distro
    if params[:name]
      @distro = Distro.where(:name => params[:name]).first
    else
      @distro = Distro.find(params[:id])

SELECT "distros".* FROM "distros"
---
  def index
    @distros = Distro.all

INSERT INTO "distros" ("created_at", "info", "name", "updated_at", "valid") VALUES (?, ?, ?, ?, ?)  [["created_at", Thu, 02 Jan 2014 22:53:40 UTC +00:00], ["info", "version 12.04 lts"], ["name", "ubuntu"], ["updated_at", Thu, 02 Jan 2014 22:53:40 UTC +00:00], ["valid", true]]
---
  def create
    @distro = Distro.new(distro_params)

    respond_to do |format|
      if @distro.save

DELETE FROM "distros" WHERE "distros"."id" = ?  [["id", 3]]
---
  def destroy
    @distro.destroy